help_msg = ''' 
Чтоб посмотреть список соседей:

<b>По выбранному дому</b>
Жми: <code>Смотреть соседей 👫 ➡ Дом ➡ Показать всех в этом доме 🏠</code>\n

<b>По выбранному подъезду</b>
Жми: <code>Смотреть соседей 👫 ➡ Дом ➡ Подъезд</code>\n

<b>По своему будинку</b>
Жми: <code>'Мой дом 🏠'</code>

<b>По своему подъезду</b>
Жми: <code>'Мой подъезд 🔢'</code>

Чтоб добавить или изменить свои данные:

Жми: <code>Изменить свои данные ✏️</code>, выбери свой <i>дом, подъезд, этаж, квартиру</i>\n

Исключительные ситуации:

Если у вас больше одной квартиры - сообщите это <a href="tg://user?id=62802418">СЮДА</a> или вашему админу. Вашу информацию поправят вручную. 
'''

about_msg = '''
Привет!

Я бот, который помогает формировать список жителей ЖК «Архитекторов». Его можно посмотреть и связаться со своим соседом. По мере возможностей и пожеланий я буду обрастать новыми полезными функциями.

Служебные команды:
/start - главное меню
/help - описание функционала
/about - про бота

С пропозициями и замечаниями обращайтесь <a href="tg://user?id=62802418">СЮДА</a>.
'''

building_msg = '''
💠 Главные ресурсы для ЖК «Архитекторов»

👉 <a href="https://t.me/HouseChatKeeperBot">Полезный инфобот</a>

💠 Коменданты

📞 +380577815283
🔸 График работы: ПН-ПТ 8.30-16.00 Перерыв: 12:00 - 13:00
🔸 Находится на первом этаже 2-го подъезда 13-го дома

💠 Почтовий индекс и полный адрес

🔸 61174, ул. Архитекторов, дом 3, 5, 7, 9, 11 или 13

💠 Почтовые отделения

🔸 УкрПочта отделение №174 - пр. Победы, 75-а, @ukrposhta_chatbot
🔸 НоваПочта №53 (до 30 кг) - пр. Победы, 65-г (ост. Школьная), @NovaPoshta_Bot
🔸 МистЕкспресс - пр. Победы 70-а (ост. Солнечная)

💠 Оплатить комунальные услуги

👉 <a href="https://www.privat24.ua/">Privat24</a>
👉 <a href="https://erc.megabank.ua/ua/paygo/kh">Megabank</a>

💠 Передать показания приборов учета

👉 <a href="http://cab.busha.in/">Все кабинеты в одном месте</a>
👉 <a href="http://billing.vodokanal.kharkov.ua">КП Харьковводоканал</a> - показания приборов учета воды (холодной и горячей) необходимо передавать до 20 числа за текущий месяц.
👉 <a href="https://www.hts.kharkov.ua/cabinet/login">КП ХТС (Харьковские Тепловые Сети)</a> - показания приборов учета тепла необходимо передавать с 20 по 25 число за текущий месяц до конца отопительного сезона.
❗Имейте в виду, что показания по горячей воде, переданные для КП «Харьковводоканал», учитываются независимо от КП «ХТС».

💠 ЖЕК ЖС-1

📞 +380573383067
🔸 вул. Целиноградская, 42
🔸 Прием граждан: ПН, ЧТ 13:00-17:00

💠 Аварийка Горлифта

📞 +380675426021

💠 Интернет-провайдеры/кабельное ТВ

👉 <a href="https://maxnet.ua/">Макснет</a>, @maxnetua_bot
👉 <a href="http://triolan.com/">Триолан</a>, @triolan_info_bot

💠 Поликлиники

🏥 14 детская - пр. Л. Свободы, 48-В,
📞 +380577250399
📞 +380577250385

🏥 <a href="http://8pol.city.kharkov.ua/">8 поликлиника</a> - пр. Победы, 53,
📞 +380577251140
📞 +380577251141
 
🏥 <a href="https://cab.mcplus.com.ua/">Вызов врача домой или запись на прием</a>

💠 Частные клиники

🏥 <a href="https://www.unilic.com.ua/">УниЛик</a>, медицинский центр - пр. Победы, 67-В
🏥 <a href="http://myfamily-doctor.com.ua/">Семейний доктор</a>, медицинский центр - пр. Победы, 64
🏥 <a href="https://alternativa-mc.com.ua/">Альтернатива</a>, медицинский центр - пр. Л. Свободы, 50-В
🏥 <a href="https://aremit.com.ua/">Аремит</a>, медицинский центр - пр. Е. Ахсарова, 8
🏥 <a href="http://analitika-lab.com.ua/">Аналитика</a>, медицинская лаборатория - пр. Л. Свободы, 32
🏥 <a href="https://doctorlor.com.ua/">Доктор Лор</a>, медицинский кабинет - пр. Л. Свободы, 31
🏥 <a href="http://dynasty-clinic.com.ua/">Династия</a>, ЛОР кабинет и стоматология - пр. Победы, 66-І

💠 Стоматология

🏥 Стоматологическая поликлиника №7 - пр. Победы, 53-А, +380577250788
🏥 <a href="hhttps://morozov-clinic.kh.ua/">Стоматологическая клиника доктора Морозова</a> - пр. Победы, 85
🏥 ПП Уваров, стомат. кабинет - пр. Победы, 73-Б, +380502691873
🏥 Университетский стоматологический центр ХНМУ - пр. Победы, 51-Б, +380577732498
🏥 Науменко А.В., стомат. кабинет - пр. Победы, 52-Б, +380977507909
🏥 <a href="http://dental.kharkov.ua/">Dental Union Studio</a> - пр. Победы, 58-А
🏥 «Stomat», стоматология - пр. Л. Свободы, 53-Б
🏥 Аполлония, стоматология - пр. Л. Свободы, 41, +380965305212
🏥 <a href="http://www.grand-stom.com/">Гранд</a>, стоматология - пр. Л. Свободы, 31
🏥 DDS, стомат. кабинет - пр. Л. Свободы, 50-В, +380507419072
🏥 Shark, стоматологичя - вул. Целиноградская, 50, +380573370171
🏥 Астра, стоматология - вул. Ахсарова, 4/6-А, +380577733133
🏥 <a href="https://to-day.com.ua/">TODAY</a>, стоматология - вул. Ахсарова, 13
🏥 <a href="http://vash-stomatolog.com.ua/">Ваш стоматолог</a>, стоматология - вул. Ахсарова, 18
🏥 <a href="https://www.facebook.com/dentalparkKharkiv/">Dental Park</a>, стоматология - вул. Е. Ахсарова, 17-Г


💠 Ветеринария

🐶 Айболит, вет. кабинет - пр. Победы, 77-Г
🐶 <a href="http://zoodoctor.kharkov.ua/">ЗооДоктор</a>, вет. клиника - пр. Л. Свободы, 60-А
🐶 <a href="http://vetexpert.com.ua/">VETEXPERT</a>, вет. клиника - пр. Победы, 65-Г
🐶 Пухнастик, вет. кабинет - пр. Победы, 55-Е 

💠 Мы на карте

👉 <a href = "https://goo.gl/maps/hMLUTgHc8iTdQzkn7">Google Maps</a>
👉 <a href= "https://go.2gis.com/dxeon">2GIS</a>
'''

greeting_msg = '''
Приветствую, {}!, добавляйтесь в список соседей в http://tiny.cc/1r27jz или в @HousebuildingArchitectsBot, и придерживайтесь правил чата.
'''

chat_admins = '''
Домостроительная 3 (16-этажка) - @Arnoldovna88
Домостроительная 5 - @Nata_8282
Домостроительная 7 - @Natasha_Aleksandrova
Домостроительная 9 - @AntonGennadevich
Домостроительная 11 - @AnswerX
Домостроительная 13 - @Fisa_Plombir
'''

private_greetings_message = """
Добрый день, вас приветствует чат-бот ЖК «Архитекторов». В группе работает модерация участников. У вас есть 8 часов с момента добавления сюда, чтобы заполнить анкету соседей <a href="http://tiny.cc/1r27jz">ТУТ</a>. В этом боте так же можно зарегистрироваться и указать дом, подъезд, этаж и квартиру.

Для рекламы своих услуг и товаров, продажи вещей и важных объявлений создан отдельный чат с объявлениями.
Спам в личку участникам чата запрещен. 
Политика, ругательства и оскорбления участников чата запрещены. 
Спасибо за понимание!
"""

house_3 = {
    'section_1': [i for i in range(1, 17)]
}

house_5 = {
    'section_1': [i for i in range(1, 7)],
    'section_2': [i for i in range(1, 7)],
    'section_3': [i for i in range(1, 7)],
    'section_4': [i for i in range(1, 7)],
    'section_5': [i for i in range(1, 7)]
}

house_7 = {
    'section_1': [i for i in range(1, 10)]
}

house_9 = {
    'section_1': [i for i in range(1, 10)]
}

house_11 = {
    'section_1': [i for i in range(1, 10)],
    'section_2': [i for i in range(1, 10)],
    'section_3': [i for i in range(1, 10)],
    'section_4': [i for i in range(1, 10)]
}

house_13 = {
    'section_1': [i for i in range(1, 10)],
    'section_2': [i for i in range(1, 10)],
    'section_3': [i for i in range(1, 10)],
    'section_4': [i for i in range(1, 10)]
}

houses_arr = {
    'house_3': house_3,
    'house_5': house_5,
    'house_7': house_7,
    'house_9': house_9,
    'house_11': house_11,
    'house_13': house_13
}
